# Removendo linhas duplicadas no Pandas

In [6]:
import numpy as np
import pandas as pd

In [13]:
# read a dataset of movie reviewrs into DataFrame
colunas = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
usuarios = pd.read_table(r'C:\Users\william.prochnow\OneDrive - Anheuser-Busch InBev\Documents\CursosDS\DataScienceUdemy\Pandas\arquivos\duplicadas.txt', sep='|', header=None, names=colunas)
# usuarios = pd.read_table(r'C:\Users\william.prochnow\OneDrive - Anheuser-Busch InBev\Documents\CursosDS\DataScienceUdemy\Pandas\arquivos\duplicadas.txt', sep='|', header=None, names=colunas, index_col='user_id')
usuarios.head(10)

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
1        2   53      F       other     94043
2        3   23      M      writer     32067
3        1   24      M  technician     85711
4        4   24      M  technician     43537
5        5   33      F       other     15213
6        5   33      F       other     15213
7        1   24      M  technician     85711
8        6   53      F       other     43537

In [14]:
usuarios.shape

(9, 5)

In [15]:
usuarios.zip_code.duplicated().head(20)

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
Name: zip_code, dtype: bool

In [16]:
usuarios.zip_code.duplicated().sum()

4

In [17]:
usuarios.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8    False
dtype: bool

In [18]:
usuarios.duplicated().sum()

3

In [19]:
# Mantenha a primeira linha

usuarios.loc[usuarios.duplicated(keep='first'), :]

   user_id  age gender  occupation  zip_code
3        1   24      M  technician     85711
6        5   33      F       other     15213
7        1   24      M  technician     85711

In [20]:
# Mantenha a última linha

usuarios.loc[usuarios.duplicated(keep='last'), :]

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
3        1   24      M  technician     85711
5        5   33      F       other     15213

In [21]:
# Todas as linhas duplicadas

usuarios.loc[usuarios.duplicated(keep=False), :]

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
3        1   24      M  technician     85711
5        5   33      F       other     15213
6        5   33      F       other     15213
7        1   24      M  technician     85711

In [22]:
# Apagando as linhas duplicadas (inplace=false por default) - shape do dataset que FICOU

usuarios.drop_duplicates(keep='first').shape

(6, 5)

In [23]:
usuarios.drop_duplicates(keep='last').shape

(6, 5)

In [24]:
usuarios.drop_duplicates(keep=False).shape

(4, 5)

# Utilizando o maior arquivo

In [25]:
# read a dataset of movie reviewers into a Dataframe

colunas = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
usuarios = pd.read_table(r'C:\Users\william.prochnow\OneDrive - Anheuser-Busch InBev\Documents\CursosDS\DataScienceUdemy\Pandas\arquivos\espectadores.txt', sep='|', header=None, names=colunas, index_col='user_id')
usuarios.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [26]:
# Verificando linhas e colunas

usuarios.shape

(943, 4)

# Encontrando linhas duplicadas com duplicated()

In [28]:
# Procurando por CEPs duplicados

usuarios.zip_code.duplicated().head(50)

user_id
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29     True
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
50    False
Name: zip_code, dtype: bool

In [29]:
# Como aprendemos, uma séria boleana pode ser convertida em 0 e 1 automaticamente ao utilizarmos métodos de agregação

usuarios.zip_code.duplicated().sum()

148

In [30]:
# Verificando se UMA LINHA INTEIRA é duplicada

usuarios.duplicated().tail()

user_id
939    False
940    False
941    False
942    False
943    False
dtype: bool

In [31]:
# Contando as linhas duplicadas

usuarios.duplicated().sum()

7

## Regras para o método duplicated

### **keep='first' (default): Marca as linhas duplicadas como True, Menos a primeira ocorrência.
### **keep='last': Marca as linhas duplicadas como False, Menos a última ocorrência.
### **keep=False: Marca todas as duplicadas com True.

In [32]:
# Mantendo a primeira linha

usuarios.loc[usuarios.duplicated(keep='first'), :]

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [33]:
# Mantendo a última linha

usuarios.loc[usuarios.duplicated(keep='last'), :]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630

In [34]:
# Todas as linhas duplicadas

usuarios.loc[usuarios.duplicated(keep=False), :]

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

# Apagando as linhas duplicadas com o drop_duplicate()

In [35]:
# Apagando as linhas dulicadas (inplace=False por default)

usuarios.drop_duplicates(keep='first').shape

(936, 4)

In [36]:
usuarios.drop_duplicates(keep='last').shape

(936, 4)

In [37]:
usuarios.drop_duplicates(keep=False).shape

(929, 4)

# Podemos considerar apenas algumas colunas para identificar duplicadas?

In [38]:
# Nesse caso, queremos considerar uma linha duplicada somente se idade e cep forem iguais

usuarios.duplicated(subset=['age', 'zip_code']).sum()

16

In [39]:
usuarios.drop_duplicates(subset=['age', 'zip_code']).shape

(927, 4)